---
title: "Split Lat/Long Coordinate Variables Into Seperate Variables"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Split lat/long coordinate variables into seperate variables."
type: technical_note
draft: false
---

## Preliminaries

In [8]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'

In [1]:
import pandas as pd
import numpy as np

## Create an example dataframe

In [2]:
raw_data = {'geo': ['40.0024, -105.4102', '40.0068, -105.266', '39.9318, -105.2813', np.nan]}
df = pd.DataFrame(raw_data, columns = ['geo'])
df

                  geo
0  40.0024, -105.4102
1   40.0068, -105.266
2  39.9318, -105.2813
3                 NaN

In [16]:
df.geo.str.split(',',expand=True)
df.geo.apply(lambda x: str(x).split(',')).apply(pd.Series)
df.geo.apply(lambda x: pd.Series(str(x).split(',')))

         0           1
0  40.0024   -105.4102
1  40.0068    -105.266
2  39.9318   -105.2813
3      NaN         NaN

         0           1
0  40.0024   -105.4102
1  40.0068    -105.266
2  39.9318   -105.2813
3      nan         NaN

         0           1
0  40.0024   -105.4102
1  40.0068    -105.266
2  39.9318   -105.2813
3      nan         NaN

## Split the geo variable into seperate lat and lon variables

In [3]:
# Create two lists for the loop results to be placed
lat = []
lon = []

# For each row in a varible,
for row in df['geo']:
    # Try to,
    try:
        # Split the row by comma and append
        # everything before the comma to lat
        lat.append(row.split(',')[0])
        # Split the row by comma and append
        # everything after the comma to lon
        lon.append(row.split(',')[1])
    # But if you get an error
    except:
        # append a missing value to lat
        lat.append(np.NaN)
        # append a missing value to lon
        lon.append(np.NaN)

# Create two new columns from lat and lon
df['latitude'] = lat
df['longitude'] = lon

## View the dataframe

In [4]:
df

                  geo latitude   longitude
0  40.0024, -105.4102  40.0024   -105.4102
1   40.0068, -105.266  40.0068    -105.266
2  39.9318, -105.2813  39.9318   -105.2813
3                 NaN      NaN         NaN